===================
Atomic Values - Numbers
===================

42;
-17;
3.14159;
.5;
5.0;
1e10;
1.5e-3;
2.718E2;
2.718E+2;
-2.718E+2;
-2.718E2;

---

(program
  (statement
    (expression_statement
      (expression
        (integer))))
  (statement
    (expression_statement
      (expression
        (integer))))
  (statement
    (expression_statement
      (expression
        (float))))
  (statement
    (expression_statement
      (expression
        (float))))
  (statement
    (expression_statement
      (expression
        (float))))
  (statement
    (expression_statement
      (expression
        (float))))
  (statement
    (expression_statement
      (expression
        (float))))
  (statement
    (expression_statement
      (expression
        (float))))
  (statement
    (expression_statement
      (expression
        (float))))
  (statement
    (expression_statement
      (expression
        (float))))
  (statement
    (expression_statement
      (expression
        (float)))))

===================
Atomic Values - Strings and Identifiers
===================

"hello world";
'single quoted';
"escaped \"quotes\"";
'escaped \'quotes\'';
my_identifier;
_underscore123;

---

(program
  (statement
    (expression_statement
      (expression
        (string))))
  (statement
    (expression_statement
      (expression
        (string))))
  (statement
    (expression_statement
      (expression
        (string))))
  (statement
    (expression_statement
      (expression
        (string))))
  (statement
    (expression_statement
      (expression
        (identifier))))
  (statement
    (expression_statement
      (expression
        (identifier)))))

===================
Object and System IDs
===================

#123;
#-456;
$system_prop;
'symbol;
true;
false;
$;

---

(program
  (statement
    (expression_statement
      (expression
        (object_id))))
  (statement
    (expression_statement
      (expression
        (object_id))))
  (statement
    (expression_statement
      (expression
        (system_property
          (identifier)))))
  (statement
    (expression_statement
      (expression
        (symbol
          (identifier)))))
  (statement
    (expression_statement
      (expression
        (identifier))))
  (statement
    (expression_statement
      (expression
        (identifier))))
  (statement
    (expression_statement
      (expression))))

===================
Lists
===================

{};
{1, 2, 3};
{"a", "b", "c"};
{1, "mixed", #123};

---

(program
  (statement
    (expression_statement
      (expression
        (list))))
  (statement
    (expression_statement
      (expression
        (list
          (expression
            (integer))
          (expression
            (integer))
          (expression
            (integer))))))
  (statement
    (expression_statement
      (expression
        (list
          (expression
            (string))
          (expression
            (string))
          (expression
            (string))))))
  (statement
    (expression_statement
      (expression
        (list
          (expression
            (integer))
          (expression
            (string))
          (expression
            (object_id)))))))

===================
Maps
===================

[];
[1 -> "one"];
["key" -> "value", "another" -> 123];

---

(program
  (statement
    (expression_statement
      (expression
        (map))))
  (statement
    (expression_statement
      (expression
        (map
          (map_entry
            (expression
              (integer))
            (expression
              (string)))))))
  (statement
    (expression_statement
      (expression
        (map
          (map_entry
            (expression
              (string))
            (expression
              (string)))
          (map_entry
            (expression
              (string))
            (expression
              (integer))))))))
